#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПлановаяДатаНачалаПриИзменении(Элемент)
	ПроверитьКорректностьДат();
	ОбновитьСтатусПоДатам();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ОбновитьСтатусПоДатам();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ПроверитьКорректностьДат();
	ОбновитьСтатусПоДатам();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСтатусПоДатам()
	Если Объект.Статус = Перечисления.ИТСервисы_СтатусыПроектов.Отменен Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Объект.Статус = Перечисления.ИТСервисы_СтатусыПроектов.Завершен;
	ИначеЕсли ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.Статус = Перечисления.ИТСервисы_СтатусыПроектов.ВРаботе;
	ИначеЕсли ЗначениеЗаполнено(Объект.ПлановаяДатаНачала) Тогда
		Объект.Статус = Перечисления.ИТСервисы_СтатусыПроектов.Планируется;
	Иначе
		Объект.Статус = Неопределено;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКорректностьДат()
	Если ЗначениеЗаполнено(Объект.ПлановаяДатаНачала) И ЗначениеЗаполнено(Объект.ПлановаяДатаОкончания) Тогда
		Если Объект.ПлановаяДатаНачала > Объект.ПлановаяДатаОкончания Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата начала плана больше даты окончания!", , "Объект.ПлановаяДатаНачала");
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Если Объект.ДатаНачала > Объект.ДатаОкончания Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая дата начала больше даты окончания!", , "Объект.ДатаНачала");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
