#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПлановаяДатаНачалаПриИзменении(Элемент)
	
	ОбновитьСтатусПоДатам();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ОбновитьСтатусПоДатам();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ОбновитьСтатусПоДатам();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСтатусПоДатам()
	
	Если Объект.Статус = Перечисления.ИТСервисы_СтатусыПроектов.Отменен Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Объект.Статус = Перечисления.ИТСервисы_СтатусыПроектов.Завершен;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		
		Объект.Статус = Перечисления.ИТСервисы_СтатусыПроектов.ВРаботе;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ПлановаяДатаНачала) Тогда
		
		Объект.Статус = Перечисления.ИТСервисы_СтатусыПроектов.Планируется;
		
	Иначе
		
		Объект.Статус = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
