Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	Движения.ИТСервисы_СтатусыОбъектовИТ.Записывать = Истина;
	Движения.ИТСервисы_СтатусыОбъектовИТ.Очистить();

	Если ЗначениеЗаполнено(ИТСервис) Тогда
		Движение = Движения.ИТСервисы_СтатусыОбъектовИТ.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектУчета = ИТСервис;

		Движение.Статус = Перечисления.ИТСервисы_СтатусыЖизненногоЦикла.ВыведенИзЭксплуатации;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИТСервисы_ПриказОВводеВПЭ") Тогда
		ИТСервис = ДанныеЗаполнения.Проект;
		ДатаВывода = ТекущаяДата();
		Описание = "Вывод из эксплуатации на основании приказа о вводе №" + ДанныеЗаполнения.Номер;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Приказ о выводе заполнен по данным ввода сервиса: " + ИТСервис.Наименование);		
	КонецЕсли;
КонецПроцедуры