Функция ПолучитьДанныеЛицензийКоторыеИстекают() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|   СостоянияЛицензий.Лицензия КАК Лицензия,
		|   ПРЕДСТАВЛЕНИЕ(СостоянияЛицензий.Лицензия) КАК ПредставлениеЛицензии,
		|   СостоянияЛицензий.ДнейДоОкончания КАК ДнейДоОкончания
		|ИЗ
		|   РегистрСведений.ИТСервисы_СостоянияЛицензий КАК СостоянияЛицензий
		|ГДЕ
		|   СостоянияЛицензий.ДнейДоОкончания <= &ДнейДоУведомления";
	
	Запрос.УстановитьПараметр("ДнейДоУведомления", 15);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ДанныеСтроки = Новый Структура("Лицензия, ПредставлениеЛицензии, ДнейДоОкончания", 
			Выборка.Лицензия, // Теперь ссылка передается на клиент!
			Выборка.ПредставлениеЛицензии, 
			Выборка.ДнейДоОкончания);
		Результат.Добавить(ДанныеСтроки);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции