Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЧерныйЦвет = Новый Цвет(0, 0, 0);
	ПустаяЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	
	Высота = ДокументРезультат.ВысотаТаблицы;
	Ширина = ДокументРезультат.ШиринаТаблицы;
	СтартоваяСтрока = 0;
	Для Р = 1 По Мин(Высота, 25) Цикл
		Для К = 1 По Ширина Цикл
			Если Найти(ДокументРезультат.Область(Р, К).Текст, "Приказ") > 0 Тогда
				СтартоваяСтрока = ДокументРезультат.Область(Р, К).Низ + 1;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если СтартоваяСтрока > 0 Тогда Прервать; КонецЕсли;
	КонецЦикла;
	
	Если СтартоваяСтрока = 0 Тогда СтартоваяСтрока = 7; КонецЕсли;

	Для ИндексСтроки = СтартоваяСтрока По Высота Цикл
		ЖирнаяЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
		
		Для ИндексКолонки = 1 По Ширина Цикл
			
			Ячейка = ДокументРезультат.Область(ИндексСтроки, ИндексКолонки);
			Ячейка.ЦветРамки = ЧерныйЦвет;
			Ячейка.ГраницаСверху = ЖирнаяЛиния;
			Ячейка.ГраницаСнизу  = ЖирнаяЛиния;
			Если ИндексКолонки = 1 Тогда
				Ячейка.ГраницаСлева  = ЖирнаяЛиния;
				Ячейка.ГраницаСправа = ЖирнаяЛиния;
			ИначеЕсли ИндексКолонки = 2 Тогда
				Ячейка.ГраницаСлева = ЖирнаяЛиния;
			ИначеЕсли ИндексКолонки > 2 И ИндексКолонки < 8 Тогда
				Ячейка.ГраницаСлева  = ПустаяЛиния;
				Ячейка.ГраницаСправа = ПустаяЛиния;
				Если ИндексКолонки = 7 Тогда
					Ячейка.ГраницаСправа = ЖирнаяЛиния;
				КонецЕсли;
			ИначеЕсли ИндексКолонки >= 8 Тогда
				Ячейка.Обвести(ЖирнаяЛиния, ЖирнаяЛиния, ЖирнаяЛиния, ЖирнаяЛиния);
			КонецЕсли;
			
		КонецЦикла;
		ОблСверху = ДокументРезультат.Область(ИндексСтроки - 1, 1, ИндексСтроки - 1, Ширина);
		ОблСверху.ЦветРамки = ЧерныйЦвет;
		ОблСверху.ГраницаСнизу = ЖирнаяЛиния;
		
	КонецЦикла;
КонецПроцедуры