&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = Пользователи.ТекущийПользователь();		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Проект) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сначала выберите ИТ-Проект!", , "Объект.Проект");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	МассивСотрудников = ПолучитьСотрудниковПроектаНаСервере(Объект.Проект, Объект.Дата);
	Если МассивСотрудников.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В команде этого проекта еще нет сотрудников! Сформируйте команду.");
		Возврат;
	КонецЕсли;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", МассивСотрудников);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыФормы, Элемент);	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСотрудниковПроектаНаСервере(Проект, ДатаДок)
	УстДата = ?(ЗначениеЗаполнено(ДатаДок), ДатаДок, ТекущаяДатаСеанса());
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Команды.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ИТСервисы_КомандыПроектов.СрезПоследних(&Период, Проект = &Проект) КАК Команды";
	
	Запрос.УстановитьПараметр("Период", УстДата);
	Запрос.УстановитьПараметр("Проект", Проект);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");	
КонецФункции
