&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

&НаКлиенте
Процедура ИТСервисПриИзменении(Элемент)
    Если НЕ ЗначениеЗаполнено(Объект.ИТСервис) Тогда
        ОчиститьПараметрыНаФорме();
        Возврат;
    КонецЕсли;
    
    ЗаполнитьПараметрыПоСервисуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПараметрыНаФорме()
    Объект.Развитие              = Ложь;
    Объект.Сопровождение         = Ложь;
    Объект.ПланПроектаВИСУП      = Ложь;
    Объект.КодВАРМРазработчика   = "";
    Объект.Руководитель        = Неопределено;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПоСервисуНаСервере()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ИТСервисы_ПараметрыИТСервисовСрезПоследних.НаРазвитии КАК НаРазвитии,
    |	ИТСервисы_ПараметрыИТСервисовСрезПоследних.НаСопровождении КАК НаСопровождении,
    |	ИТСервисы_ПараметрыИТСервисовСрезПоследних.ПланПроектаВИСУП КАК ПланПроектаВИСУП,
    |	ИТСервисы_ПараметрыИТСервисовСрезПоследних.КодВАРМРазработчика КАК КодВАРМРазработчика,
    |	ИТСервисы_ПараметрыИТСервисовСрезПоследних.Руководитель КАК Руководитель
    |ИЗ
    |	РегистрСведений.ИТСервисы_ПараметрыИТСервисов.СрезПоследних(&ТекущаяДата, ИТСервис В (&ИТСервис)) КАК
    |		ИТСервисы_ПараметрыИТСервисовСрезПоследних";
    
    Запрос.УстановитьПараметр("ИТСервис", Объект.ИТСервис);  
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());

    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Если Выборка.Следующий() Тогда
        Объект.Развитие              = Выборка.НаРазвитии;
        Объект.Сопровождение         = Выборка.НаСопровождении;
        Объект.ПланПроектаВИСУП      = Выборка.ПланПроектаВИСУП;
        Объект.КодВАРМРазработчика   = Выборка.КодВАРМРазработчика;
        Объект.Руководитель          = Выборка.Руководитель;
    Иначе
        ОчиститьПараметрыНаФормеНаСервере();
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ОчиститьПараметрыНаФормеНаСервере()
    Объект.Развитие              = Ложь;
    Объект.Сопровождение         = Ложь;
    Объект.ПланПроектаВИСУП      = Ложь;
    Объект.КодВАРМРазработчика   = "";
    Объект.Руководитель          = Неопределено;
КонецПроцедуры
