Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ИТСервис) И ЗначениеЗаполнено(ДатаНачала) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SLA.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИТСервисы_СоглашениеОбУровнеСервиса КАК SLA
		|ГДЕ
		|	SLA.ИТСервис = &ИТСервис
		|	И SLA.Ссылка <> &ТекущаяСсылка
		|	И SLA.Проведен = ИСТИНА
		|	И SLA.ДатаНачала <= &ДатаОкончания
		|	И (SLA.ДатаОкончания >= &ДатаНачала ИЛИ SLA.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))";
		
		Запрос.УстановитьПараметр("ИТСервис", ИТСервис);
		Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);

		Запрос.УстановитьПараметр("ДатаОкончания", ?(ЗначениеЗаполнено(ДатаОкончания), ДатаОкончания, '39991231'));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "На выбранный период уже существует действующее соглашение по данному сервису!";
			Сообщение.Поле = "ДатаНачала";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИТСервис) И ЗначениеЗаполнено(Провайдер) Тогда
		ДоговорСервиса = ИТСервис.ДоговорСТП;
		
		Если НЕ ЗначениеЗаполнено(ДоговорСервиса) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "У выбранного ИТ-Сервиса не указан основной 'Договор с ТП'. Заполните карточку сервиса!";
			Сообщение.Поле = "ИТСервис";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;		
		Иначе
			ПровайдерВСервисе = ДоговорСервиса.ТехПровайдер; 
			Если ПровайдерВСервисе <> Провайдер Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон(
					"Ошибка! Провайдер в соглашении (%1) не совпадает с провайдером, указанным в договоре самого ИТ-Сервиса (%2).", 
					Провайдер, 
					ПровайдерВСервисе
				);
				Сообщение.Поле = "Провайдер";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	Движения.ИТСервисы_ДвижениеДоговоровСервисов.Записывать = Истина;
	Движения.ИТСервисы_ДвижениеДоговоровСервисов.Очистить();
	
	ЗаписьНакопления = Движения.ИТСервисы_ДвижениеДоговоровСервисов.ДобавитьПриход();
	ЗаписьНакопления.Период       = Дата;
	ЗаписьНакопления.ТехПровайдер = Провайдер;
	
	ЗаписьНакопления.ВсегоДоговоров    = 1;
	ЗаписьНакопления.ДоговоровАктивных = 1;

	Движения.ИТСервисы_УровниОбслуживания.Записывать = Истина;
	Движения.ИТСервисы_УровниОбслуживания.Очистить();
	
	ЗаписьСведений = Движения.ИТСервисы_УровниОбслуживания.Добавить();
	ЗаписьСведений.Период        = Дата;
	ЗаписьСведений.ИТСервис      = ИТСервис;
	ЗаписьСведений.Провайдер     = Провайдер;

	ЗаписьСведений.ВремяРеакции  = ВремяРеакцииНаИнцидент;
	ЗаписьСведений.ВремяРешения  = ВремяРешенияИнцидента;
	ЗаписьСведений.Доступность   = ДоступностьСервиса;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИТСервисы_ДоговорСТехническимПровайдером") Тогда
		Основание = ДанныеЗаполнения.Ссылка;
		Провайдер = ДанныеЗаполнения.ТехПровайдер;
		ДатаНачала    = ДанныеЗаполнения.ДатаНачало; 
		ДатаОкончания = ДанныеЗаполнения.ДатаОкончание;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ SLA заполнен на основании договора: " + ДанныеЗаполнения.Номер);	
	КонецЕсли;	
КонецПроцедуры