
&НаКлиенте
Процедура УслугиДоговораУслугаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.УслугиДоговора.ТекущиеДанные;
	Если ТекущиеДанные.Услуга <> Неопределено Тогда
		ТекущиеДанные.Стоимость = ПолучитьЦенуНоменклатурыНаСервере(ТекущиеДанные.Услуга, Объект.Дата);
		РассчитатьСуммуДоговора();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатурыНаСервере(Знач Номенклатура, Знач ДатаДокумента)
	Отбор = Новый Структура("Номенклатура", Номенклатура);
	ЗначенияРесурсов = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ДатаДокумента, Отбор);
	Если ЗначенияРесурсов <> Неопределено Тогда
		Возврат ЗначенияРесурсов.Цена;
	КонецЕсли;
	Возврат 0;
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммуДоговора()
	СуммаВсего = 0;
	Для Каждого Стр Из Объект.УслугиДоговора Цикл
		СуммаВсего = СуммаВсего + Стр.Стоимость;
	КонецЦикла;
	Объект.Сумма = СуммаВсего;
КонецПроцедуры

&НаКлиенте
Процедура УслугиДоговораСтоимостьПриИзменении(Элемент)
	РассчитатьСуммуДоговора();
КонецПроцедуры

&НаКлиенте
Процедура УслугиДоговораПриИзменении(Элемент)
	РассчитатьСуммуДоговора();
КонецПроцедуры
