
&НаКлиенте
Процедура ДатаВыводаПриИзменении(Элемент)
	
	ПроверитьДаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗапускаПриИзменении(Элемент)
	
	ПроверитьДаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДаты()
	
	ДатаЗапуска = Объект.ДатаЗапуска;
	ДатаВывода = Объект.ДатаВывода;
	
	Если Не ДатаЗапуска = Неопределено И Не ДатаВывода = Неопределено Тогда
		Если ДатаВывода < ДатаЗапуска Тогда
			Сообщить("Дата вывода не может быть меньше даты запуска", СтатусСообщения.Внимание);
			Объект.ДатаВывода = ДатаЗапуска;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
