&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ОбработатьВидимостьКонтрагента();
    ОбработатьВидимостьДатыВывода();
КонецПроцедуры

&НаКлиенте
Процедура ВнешнийСервисПриИзменении(Элемент)
    ОбработатьВидимостьКонтрагента();
КонецПроцедуры

&НаКлиенте
Процедура АктивенПриИзменении(Элемент)
    ОбработатьВидимостьДатыВывода();
КонецПроцедуры

&НаСервере
Процедура ОбработатьВидимостьКонтрагента()
    Если НЕ Объект.ВнешнийСервис Тогда
        Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
    КонецЕсли;
    Элементы.Контрагент.Видимость = Объект.ВнешнийСервис;
КонецПроцедуры

&НаСервере
Процедура ОбработатьВидимостьДатыВывода()
    Если Объект.Активен Тогда
        Объект.ДатаВывода = Дата(1, 1, 1);
    КонецЕсли;
    Элементы.ДатаВывода.Видимость = НЕ Объект.Активен;
КонецПроцедуры