&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ОбработатьВидимостьКонтрагента();
    ОбработатьВидимостьДатыВывода();
КонецПроцедуры

&НаКлиенте
Процедура ВнешнийСервисПриИзменении(Элемент)
    ОбработатьВидимостьКонтрагента();
КонецПроцедуры

&НаКлиенте
Процедура АктивенПриИзменении(Элемент)
    ОбработатьВидимостьДатыВывода();
КонецПроцедуры

&НаСервере
Процедура ОбработатьВидимостьКонтрагента()
    Если НЕ Объект.ВнешнийСервис Тогда
        Объект.ТехПровайдер = Справочники.Контрагенты.ПустаяСсылка();
    КонецЕсли;
    Элементы.ТехПровайдер.Видимость = Объект.ВнешнийСервис;
КонецПроцедуры

&НаСервере
Процедура ОбработатьВидимостьДатыВывода()
    Если Объект.Активен Тогда
        Объект.ДатаВывода = Дата(1, 1, 1);
    КонецЕсли;
    Элементы.ДатаВывода.Видимость = НЕ Объект.Активен;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    Если Объект.ДатаВывода <> Дата(1, 1, 1) И Объект.ДатаВывода < Объект.ДатаЗапуска Тогда
        Отказ = Истина;
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Дата вывода не может быть меньше даты запуска!";
        Сообщение.Сообщить();
    КонецЕсли;
КонецПроцедуры