
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьТаблицуЗагрузки();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ОбработатьВидимостьКонтрагента();
    ОбработатьВидимостьДатыВывода();
    
    // Заполнение таблицы загрузки при открытии
    ЗаполнитьТаблицуЗагрузки();
КонецПроцедуры

&НаКлиенте
Процедура ВнешнийСервисПриИзменении(Элемент)
    ОбработатьВидимостьКонтрагента();
КонецПроцедуры

&НаКлиенте
Процедура АктивенПриИзменении(Элемент)
    ОбработатьВидимостьДатыВывода();
КонецПроцедуры

&НаСервере
Процедура ОбработатьВидимостьКонтрагента()
    Если НЕ Объект.ВнешнийСервис Тогда
        Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
    КонецЕсли;
    Элементы.Контрагент.Видимость = Объект.ВнешнийСервис;
КонецПроцедуры

&НаСервере
Процедура ОбработатьВидимостьДатыВывода()
    Если Объект.Активен Тогда
        Объект.ДатаВывода = Дата(1, 1, 1);
    КонецЕсли;
    Элементы.ДатаВывода.Видимость = НЕ Объект.Активен;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЗагрузки()
    // Очистка таблицы перед заполнением
    ТаблицаЗагрузки.Очистить();
    
    // Запрос к регистру остатков
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ИТСервисы_ДвижениеРесурсовСервисовОстатки.Сотрудник КАК Сотрудник,
    |	ИТСервисы_ДвижениеРесурсовСервисовОстатки.Роль КАК Роль,
    |	СУММА(ИТСервисы_ДвижениеРесурсовСервисовОстатки.ПроцентЗанятостиОстаток) КАК ПроцентЗанятостиОстаток
    |ИЗ
    |	РегистрНакопления.ИТСервисы_ДвижениеРесурсовСервисов.Остатки(, ИТСервис = &Сервис) КАК ИТСервисы_ДвижениеРесурсовСервисовОстатки
    |СГРУППИРОВАТЬ ПО
    |	ИТСервисы_ДвижениеРесурсовСервисовОстатки.Сотрудник,
    |	ИТСервисы_ДвижениеРесурсовСервисовОстатки.Роль";
    Запрос.УстановитьПараметр("Сервис", Объект.Ссылка);
    
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = ТаблицаЗагрузки.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
    КонецЦикла;
КонецПроцедуры