#Область ПрограммныйИнтерфейс

Процедура ПоказатьОповещения() Экспорт
	
	МассивЛицензий = ИТСервисы_ВызовСервера.ПолучитьДанныеЛицензийКоторыеИстекают();
	
	Для Каждого Данные Из МассивЛицензий Цикл
		
		// Разбиваем логику текста на 3 сценария: просрочено, сегодня, скоро
		Если Данные.ДнейДоОкончания < 0 Тогда
			
			Заголовок = "Лицензия на ПО просрочена!";
			ТекстУведомления = СтрШаблон(
				"Срок действия лицензии на ПО: «%1» истек %2 дней назад!", 
				Данные.ПредставлениеЛицензии,
				-Данные.ДнейДоОкончания
			);
			
		ИначеЕсли Данные.ДнейДоОкончания = 0 Тогда
			
			Заголовок = "Последний день лицензии на ПО!";
			ТекстУведомления = СтрШаблон(
				"Сегодня истекает срок действия лицензии на ПО: «%1».", 
				Данные.ПредставлениеЛицензии
			);
			
		Иначе
			
			Заголовок = "Завершение лицензии на ПО";
			ТекстУведомления = СтрШаблон(
				"Осталось %1 дней до окончания срока действия лицензии на ПО: «%2».", 
				Данные.ДнейДоОкончания,
				Данные.ПредставлениеЛицензии
			);
			
		КонецЕсли;
		
		СсылкаНаКарточку = ПолучитьНавигационнуюСсылку(Данные.Лицензия);
		
		ПоказатьОповещениеПользователя(
			Заголовок, 
			СсылкаНаКарточку,                    
			ТекстУведомления,                    
			БиблиотекаКартинок.Предупреждение,
			СтатусОповещенияПользователя.Важное
		);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти