#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, РежимЗаписи, ЗаписьОперативная)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		СекундВДне = 86400;
		НаборЗаписей = РегистрыСведений.ИТСервисы_СостоянияЛицензий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Лицензия.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		
		ДнейДоОкончания = (ДатаОкончания - ТекущаяДатаСеанса()) / СекундВДне;
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаписьРегистра.Лицензия = Ссылка;
			ЗаписьРегистра.ДнейДоОкончания = ДнейДоОкончания;
			НаборЗаписей.Записать(Истина);
			
		Иначе
			
			ЗаписьРегистра = НаборЗаписей[0];
			ЗаписьРегистра.ДнейДоОкончания = ДнейДоОкончания;
			НаборЗаписей.Записать(Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти