&НаКлиенте
Асинх Процедура ЗагрузитьФайл(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Не Записать() Тогда Возврат; КонецЕсли;
	КонецЕсли;
	
	ТекСтрока = Элементы.ДокументацияСервиса.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда Возврат; КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите документ PDF";
	
	Диалог.Фильтр = "Утвержденные документы (PDF, Word, Excel)|*.pdf;*.doc;*.docx;*.xls;*.xlsx";

	ВыбранныеФайлы = Ждать Диалог.ВыбратьАсинх();
	Если ВыбранныеФайлы = Неопределено Тогда Возврат; КонецЕсли;
	
	ПолноеИмяФайла = ВыбранныеФайлы[0];
	ФайлДанных = Новый Файл(ПолноеИмяФайла);
	
	Описание = Ждать ПоместитьФайлНаСерверАсинх(,,, ПолноеИмяФайла);
	
	СохранитьФайлВБазуНаСервере(Описание.Адрес, ФайлДанных.ИмяБезРасширения, ФайлДанных.Расширение, ТекСтрока.ПолучитьИдентификатор());
КонецПроцедуры

&НаСервере
Процедура СохранитьФайлВБазуНаСервере(АдресВременногоХранилища, ИмяБезРасширения, Расширение, ИДСтрокиНаКлиенте)
	
	ТекСтрока = Объект.ДокументацияСервиса.НайтиПоИдентификатору(ИДСтрокиНаКлиенте);
	Если ПустаяСтрока(ТекСтрока.ИдентификаторСтроки) Тогда
		ТекСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	НовыйФайл = Справочники.ИТСервисы_ФайлыДокументации.СоздатьЭлемент();
	НовыйФайл.Наименование = ИмяБезРасширения + Расширение;
	НовыйФайл.ДокументВладелец = Объект.Ссылка;
	НовыйФайл.ИдентификаторСтроки = ТекСтрока.ИдентификаторСтроки;
	НовыйФайл.Расширение = Расширение;

	НовыйФайл.ФайлХранилище = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВременногоХранилища)); 
	НовыйФайл.Записать();
	
	ТекСтрока.ИмяФайла = ИмяБезРасширения + Расширение;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыгрузитьФайл(Команда)
	
	ТекСтрока = Элементы.ДокументацияСервиса.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда Возврат; КонецЕсли;
	
	ДанныеФайла = ПолучитьДанныеФайлаНаСервере(ТекСтрока.ИдентификаторСтроки);
	Если ДанныеФайла = Неопределено Тогда 
		ПоказатьПредупреждение(, "Файл не найден!"); 
		Возврат; 
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.ПолноеИмяФайла = ТекСтрока.ИмяФайла;
	
	ВыбранныеФайлы = Ждать Диалог.ВыбратьАсинх();
	Если ВыбранныеФайлы = Неопределено Тогда Возврат; КонецЕсли;

	Ждать ПолучитьФайлССервераАсинх(ДанныеФайла.Адрес, ВыбранныеФайлы[0]);
	
	ПоказатьОповещениеПользователя("Успешно", , "Файл выгружен!");
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеФайлаНаСервере(ИДСтроки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.ФайлХранилище КАК Хранилище,
		|	Файлы.Расширение КАК Расширение
		|ИЗ
		|	Справочник.ИТСервисы_ФайлыДокументации КАК Файлы
		|ГДЕ
		|	Файлы.ИдентификаторСтроки = &ИДСтроки";
	
	Запрос.УстановитьПараметр("ИДСтроки", ИДСтроки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Хранилище = Выборка.Хранилище.Получить();
		Если Хранилище <> Неопределено Тогда
			Адрес = ПоместитьВоВременноеХранилище(Хранилище, УникальныйИдентификатор);
			Возврат Новый Структура("Адрес, Расширение", Адрес, Выборка.Расширение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции
