&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
    	Объект.ДатаОкончания = Дата(3999, 12, 31, 23, 59, 59);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьДатыОкончанияИДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЛицензированияПриИзменении(Элемент)
	
	ОбновитьВидимостьДатыОкончанияИДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДатыОкончанияИДоговора()
	
	ТипЛицензии = Объект.ТипЛицензирования;
	
	СкрытьДату = ТипЛицензии = ПредопределенноеЗначение("Перечисление.ИТСервисы_ТипыЛицензирования.Бессрочная")
	ИЛИ ТипЛицензии = ПредопределенноеЗначение("Перечисление.ИТСервисы_ТипыЛицензирования.OpenSource");
	
	СкрытьДоговор = ТипЛицензии = ПредопределенноеЗначение("Перечисление.ИТСервисы_ТипыЛицензирования.OpenSource");
	
	Если СкрытьДату Тогда
		Объект.ДатаОкончания = Неопределено;
	КонецЕсли;
	
	Если СкрытьДоговор Тогда
		Объект.Договор = Неопределено;
	КонецЕсли;
	
	Элементы.ДатаОкончания.Видимость = НЕ СкрытьДату;
	Элементы.Договор.Видимость = НЕ СкрытьДоговор;
	
КонецПроцедуры
