#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ИТСервис) И ЗначениеЗаполнено(Организация) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	1 КАК Поле1
			|ИЗ
			|	Справочник.ИТСервисы_ИТСервисы.Организации КАК ТЧ_Организации
			|ГДЕ
			|	ТЧ_Организации.Ссылка = &Проект
			|	И ТЧ_Организации.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Проект", ИТСервис);
		Запрос.УстановитьПараметр("Организация", Организация);

		Если Запрос.Выполнить().Пустой() Тогда
			
			ТекстОшибки = СтрШаблон(
				"Выбранная организация «%1» отсутствует в списке допустимых организаций для ИТ-Сервиса «%2».", 
				Организация, 
				ИТСервис
			);	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Поле = "Организация"; 
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;		
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПлановаяДатаНачала) И ЗначениеЗаполнено(ПлановаяДатаОкончания) Тогда
		Если ПлановаяДатаНачала > ПлановаяДатаОкончания Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Плановая дата начала не может быть больше плановой даты окончания!";
			Сообщение.Поле  = "ПлановаяДатаНачала";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		Если ДатаНачала > ДатаОкончания Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Фактическая дата начала не может быть больше даты окончания!";
			Сообщение.Поле  = "ДатаНачала";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти