#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ИТСервис) И ЗначениеЗаполнено(Организация) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	1 КАК Поле1
			|ИЗ
			|	Справочник.ИТСервисы_ИТСервисы.Организации КАК ТЧ_Организации
			|ГДЕ
			|	ТЧ_Организации.Ссылка = &ИТСервис
			|	И ТЧ_Организации.Организация = &Организация";
		
		Запрос.УстановитьПараметр("ИТСервис", ИТСервис);
		Запрос.УстановитьПараметр("Организация", Организация);

		Если Запрос.Выполнить().Пустой() Тогда
			
			ТекстОшибки = СтрШаблон(
				"Выбранная организация «%1» отсутствует в списке допустимых организаций для ИТ-Сервиса «%2».", 
				Организация, 
				ИТСервис
			);	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Поле = "Организация"; 
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;		
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти