&НаКлиенте
Процедура ПодборСотрудников(Команда)
	МассивУжеВыбранных = Новый Массив;
	Для Каждого ТекСтрока Из Объект.Участники Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Сотрудник) И ЗначениеЗаполнено(ТекСтрока.РольВКоманде) Тогда
			ДанныеИсключения = Новый Структура("Сотрудник, Роль", ТекСтрока.Сотрудник, ТекСтрока.РольВКоманде);
			МассивУжеВыбранных.Добавить(ДанныеИсключения);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Проект", Объект.Проект); 
	ПараметрыФормы.Вставить("УжеВыбранные", МассивУжеВыбранных);
	
	ОткрытьФорму("Документ.ИТСервисы_ФормированиеКомандыПроекта.Форма.ФормаПодбора", 
		ПараметрыФормы, 
		Элементы.Участники);	
КонецПроцедуры

&НаКлиенте
Процедура УчастникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для Каждого ДанныеСотрудника Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.Участники.Добавить();
			НоваяСтрока.Сотрудник = ДанныеСотрудника.Сотрудник;
			НоваяСтрока.РольВКоманде = ДанныеСотрудника.Роль;
		КонецЦикла;		

		Элементы.Участники.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Элементы.Участники.ТекущийЭлемент = Элементы.УчастникиВыделяемыеЧасы;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УчастникиВыделяемыеЧасыПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Участники.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	Норма = ПолучитьНормуЧасовНаСервере(ТекСтрока.Сотрудник, ТекСтрока.РольВКоманде, Объект.Дата);
	
	Если Норма > 0 Тогда
		ТекСтрока.РассчитанныйПроцент = (ТекСтрока.ВыделяемыеЧасы / Норма) * 100;
	Иначе
		ТекСтрока.РассчитанныйПроцент = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНормуЧасовНаСервере(Сотрудник, Роль, ДатаДок)
	УстДата = ?(ЗначениеЗаполнено(ДатаДок), ДатаДок, ТекущаяДатаСеанса());

	Отбор = Новый Структура("Сотрудник, Роль", Сотрудник, Роль);
	Данные = РегистрыСведений.ИТСервисы_КвалификацияСотрудников.СрезПоследних(УстДата, Отбор);
	
	Если Данные.Количество() > 0 Тогда
		Возврат Данные[0].НормаЧасовВМесяц;
	КонецЕсли;
	
	Возврат 0;	
КонецФункции
