
&НаКлиенте
Процедура УчастникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Сотрудник") Тогда	
		СтандартнаяОбработка = Ложь;	
		НоваяСтрока = Объект.Участники.Добавить();
		НоваяСтрока.Сотрудник = ВыбранноеЗначение.Сотрудник;
		НоваяСтрока.РольВКоманде = ВыбранноеЗначение.Роль;
		Элементы.Участники.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Элементы.Участники.ТекущийЭлемент = Элементы.УчастникиВыделяемыйПроцент;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодборСотрудников(Команда)
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.ИТСервисы_ФормированиеКомандыПроекта.Форма.ФормаПодбора", 
		ПараметрыФормы, 
		Элементы.Участники);	
КонецПроцедуры