#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	
	// Включаем автоматическую запись движений
	Движения.ИТСервисы_КвалификацияСотрудников.Записывать = Истина;
	
	// Проходим циклом по табличной части "Состав"
	Для Каждого ТекСтрока Из Состав Цикл
		
		// Защита от пустых строк
		Если Не ЗначениеЗаполнено(ТекСтрока.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ИТСервисы_КвалификацияСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрока.Сотрудник;
		Движение.Роль = ТекСтрока.Роль;
		Движение.СтавкаЧас = ТекСтрока.СтавкаЧас;
		Движение.МаксПроцентЗагрузки = ТекСтрока.МаксПроцентЗагрузки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти