#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	Движения.ИТСервисы_КвалификацияСотрудников.Записывать = Истина;
	
	Для Каждого ТекСтрока Из Состав Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ИТСервисы_КвалификацияСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрока.Сотрудник;
		Движение.Роль = ТекСтрока.Роль;
		Движение.Грейд = ТекСтрока.Грейд;
		Движение.СтавкаЧас = ТекСтрока.СтавкаЧас;
		Движение.НормаЧасовВМесяц = ТекСтрока.НормаЧасовВМесяц;
	КонецЦикла;

	Движения.ИТСервисы_КомпетенцииСотрудников.Записывать = Истина;
	
	Для Каждого ТекСтрока Из КомпетенцииСотрудников Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.Сотрудник) Или Не ЗначениеЗаполнено(ТекСтрока.Компетенция) Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ИТСервисы_КомпетенцииСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрока.Сотрудник;
		Движение.Компетенция = ТекСтрока.Компетенция;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти