#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт

	// Базовая проверка, чтобы не делать пустые движения
	Если НЕ ЗначениеЗаполнено(ИТСервис) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.ИТСервисы_ПараметрыИТСервисов.Записывать = Истина;
	Движения.ИТСервисы_ПараметрыИТСервисов.Очистить();
	ЗаписатьДвиженияПоПараметрамСервисов();

	Движения.ИТСервисы_СтатусыОбъектовИТ.Записывать = Истина;
	Движения.ИТСервисы_СтатусыОбъектовИТ.Очистить();
	ЗаписатьДвиженияПоСтатусамОбъектов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьДвиженияПоСтатусамОбъектов()
	
	Если ЗначениеЗаполнено(ИТСервис) Тогда
		Движение = Движения.ИТСервисы_СтатусыОбъектовИТ.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектУчета = ИТСервис; 
		Движение.Статус = Перечисления.ИТСервисы_СтатусыЖизненногоЦикла.ВПромышленнойЭксплуатации;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИТПроект) Тогда
		Движение = Движения.ИТСервисы_СтатусыОбъектовИТ.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектУчета = ИТПроект;
		Движение.Статус = Перечисления.ИТСервисы_СтатусыЖизненногоЦикла.Завершен;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьДвиженияПоПараметрамСервисов()
	
	ПредыдущееСостояние = ПолучитьПредыдущееСостояниеПараметров();
	
	ЗаписьПараметров = Движения.ИТСервисы_ПараметрыИТСервисов.Добавить();
	ЗаписьПараметров.Период = Дата;
	ЗаписьПараметров.Проект = ИТСервис;
	
	ЗаполнитьЗначенияСвойств(ЗаписьПараметров, ПредыдущееСостояние);

	ЗаписьПараметров.ПриказОВводеВПЭ = Ссылка;
	
КонецПроцедуры

Функция ПолучитьПустоеСостояниеПараметров()
	
	Состояние = Новый Структура;
	Состояние.Вставить("ДорожнаяКарта", Ложь);
	Состояние.Вставить("ПриказОВводеВПЭ", Неопределено);
	Состояние.Вставить("ПаспортСервиса", Ложь);
	Состояние.Вставить("Архитектура", Ложь);
	Состояние.Вставить("БазаЗнаний", Ложь);
	Состояние.Вставить("ДоговорТП", Неопределено);
	
	Возврат Состояние;
	
КонецФункции

Функция ПолучитьПредыдущееСостояниеПараметров()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Срез.ДорожнаяКарта КАК ДорожнаяКарта,
	|	Срез.ПриказОВводеВПЭ КАК ПриказОВводеВПЭ,
	|	Срез.ПаспортСервиса КАК ПаспортСервиса,
	|	Срез.Архитектура КАК Архитектура,
	|	Срез.БазаЗнаний КАК БазаЗнаний,
	|	Срез.ДоговорТП КАК ДоговорТП,
	|	Срез.Проект КАК Проект
	|ИЗ
	|	РегистрСведений.ИТСервисы_ПараметрыИТСервисов.СрезПоследних(&МоментДо, Проект = &Проект) КАК Срез";
	
	Запрос.УстановитьПараметр("МоментДо", Новый Граница(Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Проект", ИТСервис);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Состояние = ПолучитьПустоеСостояниеПараметров();
	
	// Ошибка была здесь. Исправлено на "Тогда"
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Состояние, Выборка); 	
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции

#КонецОбласти

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ИТСервисы_Проекты") Тогда
		Описание = "Приказ сформирован по итогам проекта: " + ДанныеЗаполнения.Наименование;
		
		ИТПроект = ДанныеЗаполнения;
		Попытка
			ИТСервис = ДанныеЗаполнения.Проект;
		Исключение
		КонецПопытки;
		ДатаВвода = ТекущаяДата();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ заполнен на основании проекта: " + ДанныеЗаполнения.Наименование);
	КонецЕсли;
КонецПроцедуры