
&НаКлиенте
Процедура СписокСвободныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// Отменяем стандартное открытие карточки сотрудника
	СтандартнаяОбработка = Ложь; 
	
	ДанныеСтроки = Элемент.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Тогда Возврат; КонецЕсли;
	
	// Упаковываем данные и закрываем форму подбора
	ПараметрыВозврата = Новый Структура;
	ПараметрыВозврата.Вставить("Сотрудник", ДанныеСтроки.Сотрудник);
	ПараметрыВозврата.Вставить("Роль", ДанныеСтроки.Роль);
	
	ОповеститьОВыборе(ПараметрыВозврата);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокСвободных.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
КонецПроцедуры